vim.g.mapleader = " "
local keymap = vim.keymap

-- ----------which key --------
-- ----------普通模式----------
require("which-key").register{
  -- 上下左右移动
  ["<s-k>"] = { "5<Up>", "5行上移" },
  ["<s-j>"] = { "5<Down>", "5行下移" },
  ["<s-h>"] = { "5<Left>", "5列左移" },
  ["<s-l>"] = { "5<Right>", "5列右移" },
  -- 单词移动
  ["w"] = { "b", "前一个单词开头" },
  ["W"] = { "W", "前一个单词结尾", },
  ["e"] = { "e", "后一个单词结尾" },
  ["E"] = { "ge", "后一个单词开头" },
  -- 视觉框移动
  m = {
    name = "视觉框",
    k = { "zt5<Up>5<Down>", "居上" },
    j = { "zb5<Down>5<Up>", "居下" },
    m = { "zz", "居中" },
  },
  -- 窗口制作
  ["|"] = { ":vsplit<CR>", "垂直分割" },
  ["-"] = { "<cmd>split<CR>", "水平分割" },
  -- 窗口移动
  ["<leader>"] = {
    name = "leader键",
    h = { "<c-w>h", "窗口左移" },
    j = { "<c-w>j", "窗口下移" },
    k = { "<c-w>k", "窗口上移" },
    l = { "<c-w>l", "窗口右移" },
    -- 取消高亮
    nh = { "<cmd>noh<CR>", "取消高亮" },
  },
  -- 窗口大小
  ["<c-h>"] = { "<c-w><", "减少窗口宽度" },
  ["<c-l>"] = { "<c-w>>", "增加窗口宽度" },
  ["<c-k>"] = { "<c-w>+", "增加窗口高度" },
  ["<c-j>"] = { "<c-w>-", "减少窗口高度" },
  -- 进入插入模式
  ["A"] = { "a", "向后插入" },
  ["a"] = { "i", "向前插入" },
  -- u键管理
  u = { "u", "重做" },
  ["<s-u>"] = { "<c-r>", "撤销重做" },
  ["<c-u>"] = { "<c-r>", "撤销重做" },
}
-- ----------视觉模式----------
require("which-key").register{
  -- 快捷移动
  ["<s-k>"] = { mode = "v", ":m '>+1<CR>gv=gv", "整体上移" },
  ["<s-j>"] = { mode = "v", ":m '<-2<CR>gv=gv", "整体下移" },
  -- 单词移动
  ["w"] = { mode = "v", "b", "前一个单词开头" },
  ["W"] = { mode = "v", "W", "前一个单词结尾", },
  ["e"] = { mode = "v", "e", "后一个单词结尾" },
  ["E"] = { mode = "v", "ge", "后一个单词开头" },
}
-- ----------插入模式----------
require("which-key").register{
  -- 上下左右移动
  ["<c-h>"] = { mode = "i", "<Left>", "左移" },
  ["<c-l>"] = { mode = "i", "<Right>", "右移" },
  ["<c-k>"] = { mode = "i", "<Up>", "上移" },
  ["<c-j>"] = { mode = "i", "<Down>", "下移" },
}

-- 删除一些不必要容易引起麻烦的键
keymap.set("n", "s", "<Nop>")
keymap.set("n", "S", "<Nop>")
keymap.set("n", "r", "<Nop>")
keymap.set("n", "q", "<Nop>")
keymap.set("n", "i", "<Nop>")
keymap.set("n", "I", "<Nop>")
